/*document.getElementById("스코티쉬폴드").onclick = function(){
  alert("클릭하지마세요");*/

/*var bobob; //변수를 만들고//
bobob = 3; //변수에 값을 넣고//
alert(bobob) //그 내용을 확인했다.//*/


//var 논리형의 참과거짓은 물어보는 질문에서 진짜인것은 참/ 반대로 아닌것은 거짓이다.//
//EX)1미만값을구해줘 = 1미만은 참/ 1초과는 거짓이다.//
/*var a = 10;
var b = 3;
var c = 13;
var d = a+b+c;
alert(d);*/
/*var a = "바나나";
var b = "주세요";
var c = a+b;
alert(c);*/
//숫자는 (+,-,곱하기,나누기)는 할수있지만 문자는 오직 +만 가능//

//주어
//주어,속성,
//주어,주어,속성
//주어,속성,속성

//주어,함수
//주어,함수(재료)

//주어,명령어()
//주어,명령어(재료)
//속성은 가역적인것과비가역적인것이 있음

//1.자바스크립트는 컴파일이 필요없는 인터프리터 언어이다. EX)java,C,fliesun같은프로그램
//자바스크립트는 컴파일은 브라우저가 자동으로 해줌
//2.자바스크립트는 그 어떤 플랫폼이라도 브라우저만 있으면 언제든지 정상작동이 됨
//3.자바는 ()안에 큰따옴표든 작은따음표든 상관없이 쓸수있다. EX)역슬러쉬에따옴표를 넣으면 적용할수있다.
var arr = [20,5,15,55,100];
//array는 arr로 줄여서 중괄호가 아닌 대괄호를 써야지 적용이된다.//
alert(arr[0]);
//[]에서 0은 첫번째에 해당된다.//

